** Hooks
#+BEGIN_SRC emacs-lisp
  ;; Remove trailing whitespaces
  ;; (add-hook 'before-save-hook 'delete-trailing-whitespace)

  ;; Folding
  (add-hook 'prog-mode-hook 'hs-minor-mode)
#+END_SRC

#+RESULTS:
| company-mode | highlight-indent-guides-mode | rainbow-delimiters-mode | hs-minor-mode | whitespace-mode |

